
-- #设置客户端连接服务器端编码
SET NAMES UTF8;
-- #丢弃数据库
DROP DATABASE IF EXISTS tq;
-- #创建数据库,设置存储的编码
CREATE DATABASE tq CHARSET=UTF8;
-- #进入该数据库
USE tq;
-- #创建保存flowerslist数据的表
CREATE TABLE list(
    mid  INT PRIMARY KEY AUTO_INCREMENT,
    nan VARCHAR(10),
    title   VARCHAR(30),
    price   VARCHAR(20),
    notPrice   VARCHAR(20),
    picture VARCHAR(100),
    carouselOne VARCHAR(100),
    carouselTwo VARCHAR(100),
    material VARCHAR(200),
    pack   VARCHAR(200),
    flowuage   VARCHAR(200),
    fgive  VARCHAR(100),
    pgive VARCHAR(100)
);
-- 插入数据
INSERT INTO list VALUES
(NULL,'a','至死不渝-4支精品红玫瑰','￥148.00','￥192.00','http://127.0.0.1:3000/imgs/f1.jpg','http://127.0.0.1:3000/detail-imgs/f-1.jpg','http://127.0.0.1:3000/detail-imgs/f-11.jpg','99支精品玫瑰（粉玫瑰和红玫瑰），满天星外围搭配','粉色雾面纸圆形包扎，中间粉玫瑰桃心造型，丝带蝴蝶结','一辈子是段太长太远的时光，执子之手，与子偕老的一辈子，相濡以沫，不离不弃的一辈子','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'b','与你共舞-33支精品...','￥358.00','￥465.00','http://127.0.0.1:3000/imgs/f2.jpg','http://127.0.0.1:3000/detail-imgs/f-2.jpg','http://127.0.0.1:3000/detail-imgs/f-22.jpg','各色玫瑰共36枝：白玫瑰22枝，粉佳人粉玫瑰14枝；粉色桔梗5枝，尤加利0.5扎','绿色/浅绿色双面人造纸，白咖罗纹带花结','再多一点点距离，我就能靠近你。清晰甜美的空气里，爱你到不能呼吸。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'c','祝你一切顺利-9支精...','￥158.00','￥206.00','http://127.0.0.1:3000/imgs/f3.jpg','http://127.0.0.1:3000/detail-imgs/f-3.jpg','http://127.0.0.1:3000/detail-imgs/f-33.jpg','11枝香槟玫瑰，多头白百合2枝，栀子叶8枝','深浅绿双面人造纸2张，米白色缎带1.5米','喜欢像是一阵风，而爱你是细水长流','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'d','长相守-11支精品红玫瑰','￥179.00','￥232.00','http://127.0.0.1:3000/imgs/f4.jpg','http://127.0.0.1:3000/detail-imgs/f-4.jpg','http://127.0.0.1:3000/detail-imgs/f-44.jpg','99枝红玫瑰','黑色雪梨纸，黑色条纹纸，玻璃纸卷，酒红色缎带花结','下雨的时候，给她撑一把雨伞；寒冷的时候，给她一个温暖的臂弯；天黑了，永远有一盏灯为她点亮；晨起时，给她一缕温暖的阳光。爱她，就送她一束99枝的玫瑰花！','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'e','不变的心-11支精品...','￥289.00','￥375.00','http://127.0.0.1:3000/imgs/f5.jpg','http://127.0.0.1:3000/detail-imgs/f-5.jpg','http://127.0.0.1:3000/detail-imgs/f-55.jpg','戴安娜粉玫瑰33枝，石竹梅20枝','内层银灰色厚棉纸，外层豌豆花压纹纸，紫红色缎带花结','怒放的生命中，缘分让我们相守，万花丛中，只为寻到你那惊艳万芳的容颜，今生今世，值得我去爱的仅仅是你，你就是我最大的眷念。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'f','青春之歌-淡粉色满天...','￥399.00','￥375.00','http://127.0.0.1:3000/imgs/f6.jpg','http://127.0.0.1:3000/detail-imgs/f-6.jpg','http://127.0.0.1:3000/detail-imgs/f-66.jpg','白玫瑰9枝，橙色多头玫6枝，尤加利叶10枝','虾粉双面牛皮纸2米，米色缎带2米','想和你在阳光的午后赏花喝茶，想和你在落日的傍晚谈天说地，用这一束灿烂温暖你的圣诞！','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'g','一辈子的诺言-33支精品红玫瑰','￥368.00','￥478.00','http://127.0.0.1:3000/imgs/f7.jpg','http://127.0.0.1:3000/detail-imgs/f-7.jpg','http://127.0.0.1:3000/detail-imgs/f-77.jpg','香槟玫瑰11枝、白色小雏菊3枝、浅紫色勿忘我4枝、栀子叶2枝','米白色平面纸1张、蓝色条纹纸1张、米白色缎带1米、60#大号魔力铁山灰包装盒','香槟玫瑰清新、脱俗，品位独特！让我们乘着芬芳的清风，手牵着手走过四季春秋。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'h','浪漫香气-9支精...','￥359.00','￥466.00','http://127.0.0.1:3000/imgs/f8.jpg','http://127.0.0.1:3000/detail-imgs/f-8.jpg','http://127.0.0.1:3000/detail-imgs/f-88.jpg','戴安娜粉玫瑰12枝，石竹梅7枝，叶上花10枝','蓝色方形花桶','走在风中今天阳光，突然好温柔，天的温柔，地的温柔，像你抱着我，把我最好的爱给你，是我全部的温柔。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'i','刚好遇见你-33支精...','￥338.00','￥439.00','http://127.0.0.1:3000/imgs/f9.jpg','http://127.0.0.1:3000/detail-imgs/f-9.jpg','http://127.0.0.1:3000/detail-imgs/f-99.jpg','雪山玫瑰66枝','牛皮英文报纸4张，白蓝细条纹罗文带2米','岁月匆匆如白驹过隙，即使时光往复，我依然爱你如初。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'j','含羞红焰-19支精品...','￥289.00','￥375.00','http://127.0.0.1:3000/imgs/f10.jpg','http://127.0.0.1:3000/detail-imgs/f-10.jpg','http://127.0.0.1:3000/detail-imgs/f-100.jpg','红玫瑰9枝，栀子叶5枝、满天星0.2扎','内层白色雾面纸，外层黑色雾面纸','当爱情的火花点燃了两颗年轻的心，整个世界似乎都是为他们而存在，为他们永恒。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）')





-- 创建登录表
USE tq;
CREATE TABLE tq_login(
    id INT PRIMARY KEY AUTO_INCREMENT,
    uname VARCHAR(50),
    upwd VARCHAR(32)
);
INSERT INTO tq_login VALUES(NULL,'tom',123456);
INSERT INTO tq_login VALUES(NULL,'jerry',456789);


--创建购物车列表
USE tq;
CREATE TABLE cartlist(
    id  INT PRIMARY KEY AUTO_INCREMENT,
    title   VARCHAR(30),
    price   VARCHAR(20),
    notPrice   VARCHAR(20),
    picture VARCHAR(100)
);
INSERT INTO cartlist VALUES
(NULL,'心若向阳-3支精品向日葵','￥239.00','￥286.00','http://127.0.0.1:3000/imgs/15.jpg'),
(NULL,'怦然心动-33支精品...','￥358.00','￥429.00','http://127.0.0.1:3000/imgs/17.jpg'),
(NULL,'爱到深处-33支精品...','299.00','￥358.00','http://127.0.0.1:3000/imgs/27.jpg'),
(NULL,'含羞红焰-19支精品...','￥289.00','￥375.00','http://127.0.0.1:3000/imgs/10.jpg'),
(NULL,'一往情深-19支精品...','￥399.00','￥518.00','http://127.0.0.1:3000/imgs/20.jpg'),
(NULL,'两情相悦-19支精品...','￥299.00','￥388.00','http://127.0.0.1:3000/imgs/11.jpg');

-- 创建主页中的蛋糕的详情表
USE tq;
CREATE TABLE indexDetails(
    id  INT PRIMARY KEY AUTO_INCREMENT,
    nan VARCHAR(10),
    mpicture VARCHAR(100),
    mprice   VARCHAR(20),
    carouselOne VARCHAR(100),
    carouselTwo VARCHAR(100),
    title VARCHAR(20),
    price   VARCHAR(20),
    material VARCHAR(200),
    flavour VARCHAR(100),
    attentive   VARCHAR(100),
    stand VARCHAR(100),
    fgiv VARCHAR(100),
    distri VARCHAR(100)
);
INSERT INTO indexDetails VALUES
(NULL,'A','http://127.0.0.1:3000/indexImages/m1.jpg','￥299.00 /8寸','http://127.0.0.1:3000/detail-imgs/b1.jpg','http://127.0.0.1:3000/detail-imgs/b-1.jpg','方形奶油鲜奶蛋糕','￥428.00','法国奶油、新加坡黑巧克力、法国咳咳粉、臻选咖啡、意大利家里安奴酒、新西兰奶油奶酪','奶油经过调配使它口味清香，这款产品结合了咖啡口味，就更能突出它的清香口感，令人回味。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','8-12人食 约28cm*18cm*5.5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'B','http://127.0.0.1:3000/indexImages/m2.jpg','￥299.00 /8寸','http://127.0.0.1:3000/detail-imgs/b2.jpg','http://127.0.0.1:3000/detail-imgs/b-2.jpg','草莓奶油鲜奶蛋糕','￥298.00','法国奶油’新加坡黑巧克力、法国君度里娇酒、新西兰黄油、韩国幼砂糖、臻选草莓‘臻选蓝莓果','初雪过后漫步在杜乐丽花园的小道上，刚刚摘下的新鲜草莓在口中化开，轻呡回味，却是君度奶油的丰盈，就是冬天巴黎的味道。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约19cm*7.0cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'C','http://127.0.0.1:3000/indexImages/m3.jpg','￥399.00 /8寸','http://127.0.0.1:3000/detail-imgs/b3.jpg','http://127.0.0.1:3000/detail-imgs/b-3.jpg','浓巧迷情冰淇淋蛋糕','￥298.00','新西兰牛奶、新西兰黄油、比利时巧克力、法国淡奶油','食物是一场文艺片。香浓醇厚的巧克力无疑是男主角，香滑绵密的冰淇淋便是高傲的女主角。舌尖的这份火花，将是味蕾的彰显。一口，迷情。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约17cm*4.3cm 提前5小时预定 若不及时食用，请放置冰箱冷冻室存储','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'D','http://127.0.0.1:3000/indexImages/m4.jpg','￥459.00 /8寸','http://127.0.0.1:3000/detail-imgs/b4.jpg','http://127.0.0.1:3000/detail-imgs/b-4.jpg','蓝莓轻乳拿破仑','￥298.00','法国奶油\新西兰黄油\臻选蓝莓\新西兰奶油奶酪\韩国幼砂糖','
拿破仑酥皮，精心调配的轻乳蛋糕，香甜的法国淡奶油以及新鲜蓝莓果，碰撞出让人品尝过就无法忘记的法国味道.','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约23cm*14cm*5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'E','http://127.0.0.1:3000/indexImages/m5.jpg','￥399.00 /8寸','http://127.0.0.1:3000/detail-imgs/b5.jpg','http://127.0.0.1:3000/detail-imgs/b-5.jpg','安逸兔奶油蛋糕','￥318.00','法国奶油、臻选酸乳、新西兰芝士、胡萝卜粒','咬下一口，进入绿野仙踪的童话世界。安逸兔带你开启奇幻冒险之旅，陪你找到被遗失的童心。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约21cm*5.5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'F','http://127.0.0.1:3000/indexImages/m6.jpg','￥339.00 /8寸','http://127.0.0.1:3000/detail-imgs/b6.jpg','http://127.0.0.1:3000/detail-imgs/b-6.jpg','黑巧克力慕斯蛋糕','￥298.00','新加坡黑巧克力、比利时牛奶巧克力、法国淡奶油、韩国幼砂糖、马来西亚可可脂、法国白兰地','这款专为深爱巧克力的人设计的经典巧克力慕斯蛋糕，表面使用喷面技术，使蛋糕更大气时尚，视觉上更有诱惑力。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约23cm*14cm*5.5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'G','http://127.0.0.1:3000/indexImages/m7.jpg','￥459.00 /8寸','http://127.0.0.1:3000/detail-imgs/b7.jpg','http://127.0.0.1:3000/detail-imgs/b-7.jpg','可爱熊奶油蛋糕','￥298.00','美国奶油、法国香草、荷兰芝士、入口即化','世界尽头，会有怎样的奇遇？让北极熊卢克和小企鹅大咚小咚陪伴你，冰凉沁爽，爱上夏天。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约27cm*17cm*4.3cm 提前5小时预定 若不及时食用，请放置冰箱冷冻室存储','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'H','http://127.0.0.1:3000/indexImages/m8.jpg','￥459.00 /8寸','http://127.0.0.1:3000/detail-imgs/b8.jpg','http://127.0.0.1:3000/detail-imgs/b-8.jpg','小女孩奶油芝士蛋糕','￥318.00','新西兰奶油芝士\法国淡奶油\韩国幼砂糖\巴氏杀菌蛋液\光明风味发酵乳\哭啦索芦荟\海盐','时光似镜，倒映着每个人最初的模样。在你的心中，是否也住着一位小女孩？她勇敢而纯真，守护着爱与梦想。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约19cm*7.5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'I','http://127.0.0.1:3000/indexImages/m9.jpg','￥359.00 /8寸','http://127.0.0.1:3000/detail-imgs/b9.jpg','http://127.0.0.1:3000/detail-imgs/b-9.jpg','爱丽丝花境鲜奶蛋糕','￥298.00','法国奶油\韩国幼砂糖\法国果茸','我想送给你们一个关于爱情的梦境，梦境里是少女行走在小镇花径的身影，回眸笑眼弯弯，一生不厌。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','2-3人食 约19cm*7.5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'J','http://127.0.0.1:3000/indexImages/m10.jpg','￥499.00 /8寸','http://127.0.0.1:3000/detail-imgs/b10.jpg','http://127.0.0.1:3000/detail-imgs/b-10.jpg','Mojito 柠.漾蛋糕','￥298.00','法国奶油、新西兰黄油、法国果茸、比利时白巧克力、马来西亚薄荷糖浆、世界臻选青柠檬、波多黎格朗姆酒、臻选薄荷叶','炎炎夏日，你是否渴望在沙滩的躺椅上享受一杯清凉的Mojito鸡尾酒呢？清凉的薄荷搭配酸爽的青柠，佐以纯正的白朗姆酒，为夏日带来无限清爽；“Mojito 柠•漾”不仅仅是一款蛋糕，更是一“杯”可以吃的Mojito鸡尾酒。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约19cm*7.5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'K','http://127.0.0.1:3000/indexImages/m11.jpg','￥499.00 /8寸','http://127.0.0.1:3000/detail-imgs/b11.jpg','http://127.0.0.1:3000/detail-imgs/b-11.jpg','沙布蕾芭菲蛋糕','￥298.00','法国淡奶油、香荚兰、法国可可粉、巧克力酱、瑞士白巧克力、新西兰黄油、行幼砂糖','于夏季而言，芭菲无疑是一款不错的选择，清凉，祛暑而有慕斯的细腻和爽滑。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约23cm*7.5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)'),
(NULL,'L','http://127.0.0.1:3000/indexImages/m12.jpg','￥359.00 /8寸','http://127.0.0.1:3000/detail-imgs/b12.jpg','http://127.0.0.1:3000/detail-imgs/b-12.jpg','摩登绿茶蛋糕','￥298.00','韩国幼砂糖、比利时白巧克力、新西兰黄油、甄选抹茶粉、防潮糖粉、法国淡奶油','这是一款绿茶口味蛋糕，采用绿茶粉制作，造型从时尚法国找到灵感，清新脱俗。','因为蛋糕的新鲜制作时间为2~6小时不等，请尽量提前一天预订，如需当天订购请提前5~7小时订单','4-7人食 约23cm*14cm*7.5cm 提前5小时预定','免费送一次性刀、叉、盘、蜡烛一套以及精美贺卡，代写您的祝福。(您下单可填写留言栏)','全国(可配送至全国1000多城市，市区免配送费)');

-- 创建主页面鲜花的数据表
USE tq;
CREATE TABLE indexFlowDel(
    lid INT PRIMARY KEY AUTO_INCREMENT,
    nan VARCHAR(10),
    xpicture VARCHAR(100),
    xtitle VARCHAR(100),
    xprice VARCHAR(20),
    xnoprice VARCHAR(20),
    carouselOne VARCHAR(100),
    carouselTwo VARCHAR(100),
    material VARCHAR(200),
    pack   VARCHAR(200),
    flowuage   VARCHAR(200),
    fgive  VARCHAR(100),
    pgive VARCHAR(100)
);
INSERT INTO indexFlowDel VALUES
(NULL,'M','http://127.0.0.1:3000/indexImages/x1.jpg','约定今生+11支红玫瑰','￥158','￥237','http://127.0.0.1:3000/detail-imgs/x-1.jpg','http://127.0.0.1:3000/detail-imgs/x-11.jpg','11支红色玫瑰，满天星黄莺点缀','咖色麻网单面包装，系拉菲草(或精美蝴蝶结)精美礼盒(礼盒样式实体店为准，如介意提前咨询客服)','人生若有牵手一人，心灵相通，冷暖与共，可谓幸福；人生短短，真心难遇，知音难得，遇之，加倍呵护，情愫漠淡。得之，倍加珍惜，约定今生。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'N','http://127.0.0.1:3000/indexImages/x2.jpg','爱情原动力+19支红玫瑰','￥188','￥282','http://127.0.0.1:3000/detail-imgs/x-2.jpg','http://127.0.0.1:3000/detail-imgs/x-22.jpg','19支红色玫瑰，外围相思梅（或等值配材）点缀','原色牛皮纸圆形包装，系银色丝带。','你不是爱情的终点，只是爱情的原动力，我将这爱情献给路旁的花朵，献给玻璃酒杯里摇晃着的晶亮阳光，献给教堂的红色圆顶。因为你，我爱上了这个世界。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'O','http://127.0.0.1:3000/indexImages/x3.jpg','永不凋零的爱+99支红玫瑰','￥488','￥732','http://127.0.0.1:3000/detail-imgs/x-3.jpg','http://127.0.0.1:3000/detail-imgs/x-33.jpg','99朵红玫瑰，默认黑色蝴蝶结如果需要红色请特别说明','内衬高档黑色珠光纸，黑色蝴蝶结系扎修饰，整体花束外围黑色小黑裙软纱圆形包装，【尾部黑纱长度不少于1米】。','弱水三千，只取一瓢；花开满园，只摘一朵；红颜无数，只恋一个。你的笑容，是我一生的美丽。我不奢不贪，只愿守候你幸福到底','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'P','http://127.0.0.1:3000/indexImages/x4.jpg','3支蓝色绣球+19粉佳人...','￥388','￥582','http://127.0.0.1:3000/detail-imgs/x-4.jpg','http://127.0.0.1:3000/detail-imgs/x-44.jpg','3支蓝色绣球花，19支粉佳人（或其他品种粉玫），5支尤加利叶，5支白色桔梗','黑色字母边框白色雾面纸多层单面扇形韩式大花束样式包装，白色蕾丝带系蝴蝶结（如无丝带替代）。','如果我的人生是拼图，你就是最重要的那一块。没有你，我的世界注定残缺。所以请永远留在我身边，让我的人生保持完整，让我的生活没有遗憾。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'Q','http://127.0.0.1:3000/indexImages/x5.jpg','温柔海浪+33支粉佳人','￥298','￥447','http://127.0.0.1:3000/detail-imgs/x-5.jpg','http://127.0.0.1:3000/detail-imgs/x-55.jpg','33支粉佳人（如无其他品种粉玫替代，介意请咨询客服），粉色满天星间插，银叶菊修饰。','内城绵纸，银灰色艺术纸圆形，外用米白色雾面纸圆形韩式包装，米色字母蝴蝶结修饰。','迷失在大海的浪花上，踩在沙滩上，听着海风吹过耳边，闻着大自然的味道，和你牵手走过每一个地方，留下那一行一行的脚印。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）'),
(NULL,'R','http://127.0.0.1:3000/indexImages/x6.jpg','遇见你+19支红玫瑰','￥218','￥327','http://127.0.0.1:3000/detail-imgs/x-6.jpg','http://127.0.0.1:3000/detail-imgs/x-66.jpg','19支红色玫瑰，情人草栀子叶点缀，','透明包装纸+黑色卡纸单面扇形包装，系红色蝴蝶结修饰。精美礼盒（礼盒样式实体店为准，如介意请提前咨询客服）','所有的奔波都是为了在雨停前遇见你。因为雨停了，我们就要在一起。','免费附送精美贺卡，代写您的祝福（下单填写留言）','全国（可配送至全国1000多城市，市区免配送费）')
